/**
 * @brief Seed levels into db
 * @author Róbert Páleš
 */

import { db } from "../src/server/db.ts";

async function seedLevels() {
    await db.pacmanLevel.upsert({
        where: { id: 1 },
        update: {},
        create: {
            name: "Easy",
            map: [
                "1111111111111111111",
                "1        1        1",
                "1        1        1",
                "1  b    111    p  1",
                "1        1        1",
                "11  111  1  111  11",
                "1     1     1     1",
                "1 1 1 1     1 1 1 1",
                "1     1     1     1",
                "1 1 1 1     1 1 1 1",
                "1     1     1     1",
                "1 1 1 1     1 1 1 1",
                "1     1     1     1",
                "1 1 1 1     1 1 1 1",
                "1     1     1     1",
                "1        P        1",
                "1        1        1",
                "11  111  1  111  11",
                "1                 1",
                "1111111111111111111"
            ]
        }
    })
    await db.pacmanLevel.upsert({
        where: { id: 2 },
        update: {},
        create: {
            name: "Medium",
            map: [
                "1111111111111111111", 
                "1        1        1",
                "1 111111 1 111111 1", 
                "1 1    1 1 1    1 1", 
                "1 1 11 1 1 1 11 1 1",
                "1      1   1      1",
                "1 1111 1 1 1 1111 1",
                "1      br po      1",
                "1 111 1     1 111 1",
                "      1     1      ",
                "11111 1111111 11111",
                "1        1        1",
                "1 1111 1 1 1 1111 1", 
                "1    1 1 P 1 1    1", 
                "1 11 1       1 11 1", 
                "1 11 11 111 11 11 1", 
                "1 11           11 1", 
                "1    111111111    1", 
                "1                 1", 
                "1111111111111111111" 
            ]
        }
    })
    await db.pacmanLevel.upsert({
        where: { id: 3 },
        update: {},
        create: {
            name: "Hard",
            map: [
                "1111111111111111111",
                "1        1        1",
                "1 11 111 1 111 11 1",
                "1                 1",
                "1 11 1 11111 1 11 1",
                "1    1       1    1",
                "1111 1111 1111 1111",
                "1    1       1    1",
                "1111 1 11r11 1 1111",
                "        bpo        ",
                "1111 1 11111 1 1111",
                "1    1       1    1",
                "1111 1 11111 1 1111",
                "1        1        1",
                "1 11 111 1 111 11 1",
                "1  1     P     1  1",
                "11 1 1 11111 1 1 11",
                "1    1   1   1    1",
                "1 111111 1 111111 1",
                "1                 1",
                "1111111111111111111"
            ]
        }
    })
}

seedLevels()
  .then(async () => { 
        await db.$disconnect() 
    })
  .catch(async (error) => { 
        console.error(error); 
        await db.$disconnect(); 
        process.exit(1) 
    })